public class MovieRepository {
    MovieRepositorySetting[] movieRepositoryArray = new MovieRepositorySetting[]{
            new MovieRepositorySetting(
                    "Унесённые призраками",
                    "Аниме",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new MovieRepositorySetting(
                    "Ходячий замок",
                    "Аниме",
                    "Полнометражка",
                    2004,
                    "Япония",
                    8.3,
                    "Хаяо Миядзаки"
            ),
            new MovieRepositorySetting(
                    "Твоё имя",
                    "Аниме",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new MovieRepositorySetting(
                    "Зелёная книга",
                    "Биография",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new MovieRepositorySetting(
                    "Поймай меня, если сможешь",
                    "Криминал",
                    "Полнометражка",
                    2002,
                    "США",
                    8.5,
                    "Стивен Спилберг"
            ),
            new MovieRepositorySetting(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new MovieRepositorySetting(
                    "Начало",
                    "Фантастика",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new MovieRepositorySetting(
                    "Брат 2",
                    "Боевик",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new MovieRepositorySetting(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new MovieRepositorySetting(
                    "Джанго освобожденный",
                    "Вестерн",
                    "Полнометражка",
                    2012,
                    "США",
                    8.2,
                    "Квентин Тарантино"
            ),
            new MovieRepositorySetting(
                    "Омерзительная восьмерка",
                    "Вестерн",
                    "Полнометражка",
                    2015,
                    "США",
                    7.9,
                    "Квентин Тарантино"
            ),
            new MovieRepositorySetting(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new MovieRepositorySetting(
                    "В бой идут одни \"старики\"",
                    "Военный",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.7,
                    "Леонид Быков"
            ),
            new MovieRepositorySetting(
                    "Пианист",
                    "Военный",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new MovieRepositorySetting(
                    "Спасти рядового Райана",
                    "Военный",
                    "Полнометражка",
                    1998,
                    "США",
                    8.2,
                    "Стивен Спилберг"
            ),
            new MovieRepositorySetting(
                    "Остров проклятых",
                    "Детектив",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new MovieRepositorySetting(
                    "Достать ножи",
                    "Детектив",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new MovieRepositorySetting(
                    "Шерлок",
                    "Детектив",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new MovieRepositorySetting(
                    "Трое из Простоквашино",
                    "Детский",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new MovieRepositorySetting(
                    "Смешарики",
                    "Детский",
                    "Мультсериал",
                    2003,
                    "Россия",
                    7.3,
                    "Илья Попов"
            ),
            new MovieRepositorySetting(
                    "Фиксики",
                    "Детский",
                    "Мультсериал",
                    2010,
                    "Россия",
                    6.9,
                    "Василий Бедошвили"
            ),
            new MovieRepositorySetting(
                    "Романовы",
                    "Документальный",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new MovieRepositorySetting(
                    "Великая война",
                    "Документальный",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new MovieRepositorySetting(
                    "Следствие вели",
                    "Документальный",
                    "Сериал",
                    2006,
                    "Россия",
                    7.9,
                    "Дмитрий Докучаев"
            ),
            new MovieRepositorySetting(
                    "Зелёная книга",
                    "Драма",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new MovieRepositorySetting(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new MovieRepositorySetting(
                    "Остров проклятых",
                    "Драма",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new MovieRepositorySetting(
                    "Топ-модель по-американски",
                    "Игра",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new MovieRepositorySetting(
                    "Проект Подиум",
                    "Игра",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new MovieRepositorySetting(
                    "Адская кухня",
                    "Игра",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new MovieRepositorySetting(
                    "Романовы",
                    "История",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new MovieRepositorySetting(
                    "Великая война",
                    "История",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new MovieRepositorySetting(
                    "Титаник",
                    "История",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new MovieRepositorySetting(
                    "Джентельмены",
                    "Комедия",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new MovieRepositorySetting(
                    "Иван Васильевич меняет профессию",
                    "Комедия",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new MovieRepositorySetting(
                    "Бриллиантовая рука",
                    "Комедия",
                    "Полнометражка",
                    1968,
                    "СССР",
                    8.5,
                    "Леонид Гайдай"
            ),
            new MovieRepositorySetting(
                    "Трое из Простоквашино",
                    "Короткометражка",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new MovieRepositorySetting(
                    "Самогонщики",
                    "Короткометражка",
                    "Короткометражка",
                    1962,
                    "СССР",
                    8.3,
                    "Леонид Гайлай"
            ),
            new MovieRepositorySetting(
                    "Наваждение",
                    "Короткометражка",
                    "Короткометражка",
                    1965,
                    "СССР",
                    8.8,
                    "Леонид Гайлай"
            ),
            new MovieRepositorySetting(
                    "Джентельмены",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new MovieRepositorySetting(
                    "Брат 2",
                    "Криминал",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new MovieRepositorySetting(
                    "Достать ножи",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new MovieRepositorySetting(
                    "Твоё имя",
                    "Мелодрама",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new MovieRepositorySetting(
                    "Титаник",
                    "Мелодрама",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new MovieRepositorySetting(
                    "Друзья",
                    "Мелодрама",
                    "Сериал",
                    1994,
                    "США",
                    9.2,
                    "Гари Хэлворсон"
            ),
            new MovieRepositorySetting(
                    "Пианист",
                    "Музыка",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new MovieRepositorySetting(
                    "Ла-Ла Ленд",
                    "Музыка",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэмьен Шазелл"
            ),
            new MovieRepositorySetting(
                    "Трое из Простоквашино",
                    "Мультфильм",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new MovieRepositorySetting(
                    "Смешарики",
                    "Мультфильм",
                    "Сериал",
                    2003,
                    "Россия",
                    7.3,
                    "Денис Чернов"
            ),
            new MovieRepositorySetting(
                    "Холодное сердце",
                    "Мультфильм",
                    "Полнометражка",
                    2013,
                    "США",
                    7.8,
                    "Крис Бак"
            ),
            new MovieRepositorySetting(
                    "Алладин",
                    "Мюзикл",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new MovieRepositorySetting(
                    "Ла-Ла Ленд",
                    "Мюзикл",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэиьен Шазелл"
            ),
            new MovieRepositorySetting(
                    "Кошмар перед Рождеством",
                    "Мюзикл",
                    "Полнометражка",
                    1993,
                    "США",
                    8.0,
                    "Генри Селик"
            ),
            new MovieRepositorySetting(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new MovieRepositorySetting(
                    "Иван Васильевич меняет профессию",
                    "Приключения",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new MovieRepositorySetting(
                    "Рапунцель: запутанная история",
                    "Приключения",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new MovieRepositorySetting(
                    "Топ-модель по-американски",
                    "Реальное ТВ",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new MovieRepositorySetting(
                    "Проект Подиум",
                    "Реальное ТВ",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new MovieRepositorySetting(
                    "Адская кухня",
                    "Реальное ТВ",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new MovieRepositorySetting(
                    "Алладин",
                    "Семейный",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new MovieRepositorySetting(
                    "Чарли и шоколадная фабрика",
                    "Семейный",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            ),
            new MovieRepositorySetting(
                    "Рапунцель: запутанная история",
                    "Семейный",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new MovieRepositorySetting(
                    "Начало",
                    "Триллер",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new MovieRepositorySetting(
                    "Шерлок",
                    "Триллер",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new MovieRepositorySetting(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new MovieRepositorySetting(
                    "Унесённые призраками",
                    "Фэнтези",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new MovieRepositorySetting(
                    "Рапунцель: запутанная история",
                    "Фэнтези",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new MovieRepositorySetting(
                    "Чарли и шоколадная фабрика",
                    "Фэнтези",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            )
    };
}
